package com.xmx.tango.module.keyboard

/**
 * Created by The_onE on 2017/6/1.
 * 假名键盘常量
 */
object KeyboardConstants {
    // 假名表
    val KANA_ARRAY = arrayOf(
            // 平假名清音
            "あ", "い", "う", "え", "お",
            "か", "き", "く", "け", "こ",
            "さ", "し", "す", "せ", "そ",
            "た", "ち", "つ", "て", "と",
            "な", "に", "ぬ", "ね", "の",
            "は", "ひ", "ふ", "へ", "ほ",
            "ま", "み", "む", "め", "も",
            "や", "い", "ゆ", "え", "よ",
            "ら", "り", "る", "れ", "ろ",
            "わ", "を", "ん", "っ", " ",
            // 平假名浊音
            "ぁ", "ぃ", "ぅ", "ぇ", "ぉ",
            "が", "ぎ", "ぐ", "げ", "ご",
            "ざ", "じ", "ず", "ぜ", "ぞ",
            "だ", "ぢ", "づ", "で", "ど",
            "な", "に", "ぬ", "ね", "の",
            "ば", "び", "ぶ", "べ", "ぼ",
            "ま", "み", "む", "め", "も",
            "ゃ", "ぃ", "ゅ", "ぇ", "ょ",
            "ぱ", "ぴ", "ぷ", "ぺ", "ぽ",
            "わ", "ゐ", "々", "ゑ", " ",
            // 片假名清音
            "ア", "イ", "ウ", "エ", "オ",
            "カ", "キ", "ク", "ケ", "コ",
            "サ", "シ", "ス", "セ", "ソ",
            "タ", "チ", "ツ", "テ", "ト",
            "ナ", "ニ", "ヌ", "ネ", "ノ",
            "ハ", "ヒ", "フ", "ヘ", "ホ",
            "マ", "ミ", "ム", "メ", "モ",
            "ヤ", "イ", "ユ", "エ", "ヨ",
            "ラ", "リ", "ル", "レ", "ロ",
            "ワ", "ー", "ン", "ッ", " ",
            // 片假名浊音
            "ァ", "ィ", "ゥ", "ェ", "ォ",
            "ガ", "ギ", "グ", "ゲ", "ゴ",
            "ザ", "ジ", "ズ", "ゼ", "ゾ",
            "ダ", "ヂ", "ヅ", "デ", "ド",
            "ナ", "ニ", "ヴ", "ネ", "ノ",
            "バ", "ビ", "ブ", "ベ", "ボ",
            "マ", "ミ", "ム", "メ", "モ",
            "ャ", "ヵ", "ュ", "ヶ", "ョ",
            "パ", "ピ", "プ", "ペ", "ポ",
            "ワ", "ヰ", "ヲ", "ヱ", " ")

    val VOICING_LINES = 10 // 切换浊音跳过行数
    val KATA_LINES = 20 // 切换片假名跳过行数
}
